window.addEventListener('load', function () {
(function ($) {
    console.log("admin.js загружен и DOM готов!");
    DateTimeShortcuts.clockHours.default_ = [
        ['Now', -1], 
        ['8 часов', 8], 
        ['9 часов', 9], 
        ['10 часов', 10], 
        ['11 часов', 11], 
        ['12 часов', 12], 
        ['13 часов', 13], 
        ['14 часов', 14], 
        ['15 часов', 15], 
        ['16 часов', 16], 
        ['17 часов', 17], 
        ['18 часов', 18], 
        ['19 часов', 19], 
        ['20 часов', 20], 
        ['21 час', 21], 
        ['22 часа', 22]
    ];})(django.jQuery);
});